<script>
import Post from "./Post.svelte";
let posts = [
    {
        author:'Asta',
        date:'10.03.2022',
        text:'Мы вынуждены отталкиваться от того, что повышение уровня гражданского сознания говорит о возможностях новых предложений. Ясность нашей позиции очевидна: понимание сути ресурсосберегающих технологий требует определения и уточнения своевременного выполнения сверхзадачи.',
    },
    {
        author:'Ahmed',
        date:'10.06.2021',
        text:'Сложно сказать, почему сделанные на базе интернет-аналитики выводы представляют собой не что иное, как квинтэссенцию победы маркетинга над разумом и должны быть смешаны с не уникальными данными до степени совершенной неузнаваемости, из-за чего возрастает их статус бесполезности. Приятно, граждане, наблюдать, как сделанные на базе интернет-аналитики выводы функционально разнесены на независимые элементы. Сложно сказать, почему элементы политического процесса указаны как претенденты на роль ключевых факторов.',
    },
    {
        author:'Abdul',
        date:'30.12.2020',
        text:'Банальные, но неопровержимые выводы, а также тщательные исследования конкурентов будут преданы социально-демократической анафеме. Безусловно, постоянное информационно-пропагандистское обеспечение нашей деятельности создаёт необходимость включения в производственный план целого ряда внеочередных мероприятий с учётом комплекса переосмысления внешнеэкономических поли',
    },
    {
        author:'Mumi',
        date:'10.03.2022',
        text:'Кстати, ключевые особенности структуры проекта представляют собой не что иное, как квинтэссенцию победы маркетинга над разумом и должны быть смешаны с не уникальными данными до степени совершенной неузнаваемости, из-за чего возрастает их статус бесполезности. Имеется спорная точка зрения, гласящая примерно следующее: базовые сценарии поведения пользователей и по сей день остаются уделом либералов, которые жаждут быть обнародованы!',
    },
    {
        author:'Johanes',
        date:'4.07.2022',
        text:'сокий уровень вовлечения представителей целевой аудитории является четким доказательством простого факта: постоянный количественный рост и сфера нашей активности прекрасно подходит для реализации стандартных подходов. Противоположная точка зрения подразумевает, что элементы политического процесса набирают популярность среди определенных слоев населения, а значит, должны быть преданы социально-демократической анафеме.',
    },
    {
        author:'Mikka',
        date:'2.03.2023',
        text:'Таким образом, высококачественный прототип будущего проекта позволяет оценить значение как самодостаточных, так и внешне зависимых концептуальных решений. Как принято считать, реплицированные с зарубежных источников, современные исследования освещают чрезвычайно интересные особенности картины в целом, однако конкретные выводы, разумеется, смешаны с не уникальными данными до степени совершенной неузнаваемости, из-за чего возрастает их статус бесполезности.',
    },
    {
        author:'astra',
        date:'10.11.2022',
        text:'И нет сомнений, что реплицированные с зарубежных источников, современные исследования рассмотрены исключительно в разрезе маркетинговых и финансовых предпосылок. В своём стремлении повысить качество жизни, они забывают, что дальнейшее развитие различных форм деятельности не оставляет шанса для новых предложений.',
    },
    {
        author:'Serega',
        date:'27.03.2023',
        text:'Принимая во внимание показатели успешности, синтетическое тестирование, а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для своевременного выполнения сверхзадачи. Значимость этих проблем настолько очевидна, что семантический разбор внешних противодействий предполагает независимые способы реализации первоочередных требований.',
    },
    {
        author:'Vitalik',
        date:'27.04.2022',
        text:'Кстати, диаграммы связей ассоциативно распределены по отраслям. А ещё непосредственные участники технического прогресса объединены в целые кластеры себе подобных.',
    },

]
</script>


    <div class="wrapper">
        {#each posts as post, i}
            <Post text={post.text} author={post.author} date={post.date}/>
        {/each}
    </div>


<style>
    .wrapper{
      display: flex;
      flex-wrap: wrap;
    }
</style>
